import 'package:flutter/material.dart';
class Package{
  final String img;  //图片
  final String title;  //标题
  final String description;  //描述
  Package(this.img,this.title,this.description);
}
List travelNoteList = [
   Package("images/bj.jpg","北京之旅","Day 01: 天安门广场(1.5小时) → 故宫(3小时) → 景山公园(1小时) → 北京全聚德(前门店)(1小时) \n Day 02: 雍和宫(2小时) → 孔庙和国子监博物馆(1.5小时) → 五道营胡同(1小时) → 簋街(2小时) \n Day 03: 恭王府(2.5小时) → 什刹海(3小时) → 南锣鼓巷(机动选择，1.5小时) \n Day 04: 天坛公园(2小时) → 鸟巢(0.5小时) → 水立方(0.5小时) \n Day 05: 北京798艺术区(3小时) → 三里屯太古里(2小时) \n Day 06: 圆明园(3小时) → 清华大学(2小时) \n Day 07: 颐和园(4小时) → 北京大学(2小时) \n Day 08: 八达岭长城(3-4小时) → 明十三陵(机动选择，2.5小时)"),
   Package("images/cq.jpg","重庆之旅","Day 01: 解放碑(2小时) → 洪崖洞民俗风貌区(1.5小时) → 千厮门大桥(30分钟) → 八一路好吃街(1小时)   \n Day 02: 磁器口古镇(2.5小时) → 重庆白公馆(30分钟) → 渣滓洞监狱旧址(30分钟) → 长江索道(15分钟) → 南山一棵树景区(2小时)   \n Day 03: 四川美术学院(黄桷坪校区)(1小时) → 重庆涂鸦一条街(1小时) → 李子坝站(10分钟) → 两路口皇冠大扶梯(20分钟) → 重庆朝天门广场(2小时)   \n Day 04: 武隆龙水峡地缝(2小时) → 武隆天生三桥(2小时) → 《印象武隆》(1.5小时)   \n Day 05: 芙蓉洞(1.5小时) → 芙蓉江国家重点风景名胜区(2小时) → 芙蓉江过江速滑(1小时)"),
   Package("images/dl.jpg","大理之旅","Day 01: 大理古城(2小时) → 崇圣寺三塔(2小时) → 三塔倒影公园(1小时) → 人民路(1小时) \n Day 02: 喜洲古镇(2小时) → 蝴蝶泉(1小时) → 双廊古镇(2小时) → 南诏风情岛(1小时) → 挖色镇(2小时) → 小普陀(1小时) \n Day 03: 苍山(1天)"),
   Package("images/gl.jpg","桂林之旅","Day 01: 榕杉湖景区(2小时) → 日月双塔文化公园(2小时) → 东西巷(2小时)  \n Day 02: 龙脊梯田(2小时) → 金坑梯田(2小时) → 金佛顶观景点(2小时)   \n Day 03: 兴坪古镇(2小时) → 漓江(2小时) → 遇龙河(2小时)  \n Day 04: 芦笛岩景区(2小时) → 象山景区(2小时) "),
   Package("images/hk.jpg","香港之旅","Day 01: 彩虹邨(1小时) → 金鱼街(1小时) → 油麻地警署(30分钟) → 麦文记面家(佐敦店)(1小时) → 重庆大厦(30分钟) → 海港城(3小时) → 庙街夜市(2小时)   \n Day 02: 香港大学(2小时) → 铜锣湾(3小时) → 半山扶梯(30分钟) → 嘉咸街(1小时) → 都爹利街石阶及煤气灯(1小时) → 太平山顶(3小时) → 天星小轮(1小时)   \n Day 03: 南丫岛榕树湾(3小时) → 洪圣爷湾泳滩(1小时) → 芦须城泳滩(1小时) → 神风洞(30分钟) → 索罟湾(2小时) → 天虹海鲜酒家(索罟湾)(1小时)   \n Day 04: 香港迪士尼乐园(1天)"),
   Package("images/hz.jpg","杭州之旅","Day 01: 断桥残雪(10分钟) → 白堤(20分钟) → 孤山(2小时) → 楼外楼(孤山路店)(1小时)   \n Day 02: 杭州西湖风景名胜区-曲院风荷(1小时) → 苏堤春晓(30分钟) → 花港观鱼(1小时) → 茅家埠(2小时)   \n Day 03: 柳浪闻莺(1小时) → 雷峰塔(2小时) → 三潭印月(1.5小时) → 吴山广场(2小时) → 河坊街(1小时) → 西湖-景区音乐喷泉(10分钟)   \n Day 04: 灵隐飞来峰(0.5小时) → 灵隐寺(1.5小时) → 龙井村(2小时) → 九溪烟树(1.5小时) → 钱塘江大桥(20分钟)   \n Day 05: 西溪国家湿地公园(3-4小时) → 浙江大学玉泉校区(1小时) → 青芝坞(1-2小时)"),
];
List packages = [
  {
    "img": "images/bj.jpg",
    "title": "北京之旅",
    "content": "Day 01: 天安门广场(1.5小时) → 故宫(3小时) → 景山公园(1小时) → 北京全聚德(前门店)(1小时) \n Day 02: 雍和宫(2小时) → 孔庙和国子监博物馆(1.5小时) → 五道营胡同(1小时) → 簋街(2小时) \n Day 03: 恭王府(2.5小时) → 什刹海(3小时) → 南锣鼓巷(机动选择，1.5小时) \n Day 04: 天坛公园(2小时) → 鸟巢(0.5小时) → 水立方(0.5小时) \n Day 05: 北京798艺术区(3小时) → 三里屯太古里(2小时) \n Day 06: 圆明园(3小时) → 清华大学(2小时) \n Day 07: 颐和园(4小时) → 北京大学(2小时) \n Day 08: 八达岭长城(3-4小时) → 明十三陵(机动选择，2.5小时)",
  },
  {
    "img": "images/cq.jpg",
    "title": "重庆之旅",
    "content": "Day 01: 解放碑(2小时) → 洪崖洞民俗风貌区(1.5小时) → 千厮门大桥(30分钟) → 八一路好吃街(1小时)   \n Day 02: 磁器口古镇(2.5小时) → 重庆白公馆(30分钟) → 渣滓洞监狱旧址(30分钟) → 长江索道(15分钟) → 南山一棵树景区(2小时)   \n Day 03: 四川美术学院(黄桷坪校区)(1小时) → 重庆涂鸦一条街(1小时) → 李子坝站(10分钟) → 两路口皇冠大扶梯(20分钟) → 重庆朝天门广场(2小时)   \n Day 04: 武隆龙水峡地缝(2小时) → 武隆天生三桥(2小时) → 《印象武隆》(1.5小时)   \n Day 05: 芙蓉洞(1.5小时) → 芙蓉江国家重点风景名胜区(2小时) → 芙蓉江过江速滑(1小时)",
  },
  {
    "img": "images/dl.jpg",
    "title": "大理之旅",
    "content": "Day 01: 大理古城(2小时) → 崇圣寺三塔(2小时) → 三塔倒影公园(1小时) → 人民路(1小时) \n Day 02: 喜洲古镇(2小时) → 蝴蝶泉(1小时) → 双廊古镇(2小时) → 南诏风情岛(1小时) → 挖色镇(2小时) → 小普陀(1小时) \n Day 03: 苍山(1天)",
  },
  {
    "img": "images/gl.jpg",
    "title": "桂林之旅",
    "content": "Day 01: 榕杉湖景区(2小时) → 日月双塔文化公园(2小时) → 东西巷(2小时)  \n Day 02: 龙脊梯田(2小时) → 金坑梯田(2小时) → 金佛顶观景点(2小时)   \n Day 03: 兴坪古镇(2小时) → 漓江(2小时) → 遇龙河(2小时)  \n Day 04: 芦笛岩景区(2小时) → 象山景区(2小时) ",
  },
  {
    "img": "images/hk.jpg",
    "title": "香港之旅",
    "content": "Day 01: 彩虹邨(1小时) → 金鱼街(1小时) → 油麻地警署(30分钟) → 麦文记面家(佐敦店)(1小时) → 重庆大厦(30分钟) → 海港城(3小时) → 庙街夜市(2小时)   \n Day 02: 香港大学(2小时) → 铜锣湾(3小时) → 半山扶梯(30分钟) → 嘉咸街(1小时) → 都爹利街石阶及煤气灯(1小时) → 太平山顶(3小时) → 天星小轮(1小时)   \n Day 03: 南丫岛榕树湾(3小时) → 洪圣爷湾泳滩(1小时) → 芦须城泳滩(1小时) → 神风洞(30分钟) → 索罟湾(2小时) → 天虹海鲜酒家(索罟湾)(1小时)   \n Day 04: 香港迪士尼乐园(1天)",
  },
  {
    "img": "images/hz.jpg",
    "title": "杭州之旅",
    "content": "Day 01: 断桥残雪(10分钟) → 白堤(20分钟) → 孤山(2小时) → 楼外楼(孤山路店)(1小时)   \n Day 02: 杭州西湖风景名胜区-曲院风荷(1小时) → 苏堤春晓(30分钟) → 花港观鱼(1小时) → 茅家埠(2小时)   \n Day 03: 柳浪闻莺(1小时) → 雷峰塔(2小时) → 三潭印月(1.5小时) → 吴山广场(2小时) → 河坊街(1小时) → 西湖-景区音乐喷泉(10分钟)   \n Day 04: 灵隐飞来峰(0.5小时) → 灵隐寺(1.5小时) → 龙井村(2小时) → 九溪烟树(1.5小时) → 钱塘江大桥(20分钟)   \n Day 05: 西溪国家湿地公园(3-4小时) → 浙江大学玉泉校区(1小时) → 青芝坞(1-2小时)",
  },
  {
    "img": "images/lj.jpg",
    "title": "丽江之旅",
    "content": "Day 01: 丽江古城(2小时) → 狮子山(1小时) → 木府(1小时) → 丽江四方街(3小时)   \n Day 02: 冰川公园(3小时) → 云杉坪(1-2小时) → 蓝月谷(1小时)   \n Day 03: 束河古镇(2小时) → 束河四方街(0.5-1小时) → 束河古镇-青龙桥(10分钟) → 九鼎龙潭(30分钟) → 三圣宫(0.5-1小时) → 茶马古道博物馆(0.5-1小时)   \n Day 04: 拉市海湿地公园(1天)",
  },
  {
    "img": "images/ls.jpg",
    "title": "拉萨之旅",
    "content": "Day 01: 布达拉宫(3小时) → 宗角禄康公园(1小时) → 大昭寺(1.5小时) → 八廓街(2小时)   \n Day 02: 哲蚌寺(2小时) → 娘热民俗风情园(2小时) → 色拉寺(2小时)   \n Day 03: 念青唐古拉山(30分钟) → 那根拉(30分钟) → 纳木错(2小时)  ",
  },
  {
    "img": "images/mh.jpg",
    "title": "漠河之旅",
    "content": "Day 01: 九曲十八弯湿地公园(2小时) → 白桦林(2小时) → 黑龙江第一湾(2小时) → 乌苏里浅滩(2小时) → 北红村(2小时)  \n Day 02: 鄂温克驯鹿园(2小时) → 北极村(3小时)  \n Day 03: 观音山(2小时) → 松苑原始森林公园(2小时) → 北极星广场(2小时) ",
  },
  {
    "img": "images/qd.jpg",
    "title": "青岛之旅",
    "content": "Day 01: 栈桥(1小时) → 浙江路天主教堂(1小时) → 中山路商业街(1.5小时) → 青岛啤酒博物馆(1.5小时) → 八大关(2小时)   \n Day 02: 仰口风景游览区(2小时) → 崂山太清宫(2小时)  \n Day 03: 金沙滩(3小时) → 青岛东方影都融创乐园(2.5小时)",
  },
  {
    "img": "images/qh.jpg",
    "title": "青海之旅",
    "content": "Day 01: 塔尔寺(2小时) → 日月山(2小时) → 青海湖(3小时)  \n Day 02: 茶卡盐湖(2小时) → 环湖西路(2小时) → 刚察草原(2小时) → 祁连山草原(2小时)  \n Day 03: 阿柔大寺(2小时) → 卓尔山(2小时) → 张掖丹霞国家地质公园(2小时)  \n Day 04: 马蹄寺(2小时) → 门源百里油菜花海(2小时) ",
  },
  {
    "img": "images/sy.jpg",
    "title": "三亚之旅",
    "content": "Day 01:  大东海旅游区(2小时) → 鹿回头风景区(3小时) → 第一市场(2小时)   \n Day 02: 南山文化旅游区(4-5小时) → 天涯海角(2小时) → 三亚湾椰梦长廊(2小时)   \n Day 03: 蜈支洲岛旅游风景区(6-8小时) → 观日岩(1小时)  \n Day 04: 亚龙湾热带天堂森林公园(4小时) → 三亚国际免税城(2小时) ",
  },
  {
    "img": "images/sz.jpg",
    "title": "苏州之旅",
    "content": "Day 01: 寒山寺(1小时) → 虎丘山风景区(2小时) → 七里山塘(2小时) → 山塘昆曲馆(2小时)   \n Day 02: 拙政园(2小时) → 苏州博物馆(2小时) → 平江路(1小时) → 金鸡湖景区(2小时)   \n Day 03: 狮子林(1小时) → 苏州大学(2小时) → 网师园(1小时)",
  },
  {
    "img": "images/tb.jpg",
    "title": "台北之旅",
    "content": "Day 01: 龙山寺(1小时) → 西门町(2小时) → 台北101(3小时) → 台北象山(3小时)   \n Day 02: 中正纪念堂(1小时) → 台北士林官邸(1小时) → 台北故宫博物院(3小时)   \n Day 03: 诚品书店(1小时) → 忠孝东路(2小时) → 国父纪念馆(1小时) → 松山文创园区(2小时) → 饶河街夜市(2小时) ",
  },
  {
    "img": "images/tj.jpg",
    "title": "天津之旅",
    "content": "Day 01: 津湾广场(2小时) → 意大利风情街(2小时) → 古文化街(2小时) → 天津之眼(2小时)  \n Day 02: 五大道(2小时) → 瓷房子(30分钟) → 劝业场商场(2小时) → 南市食品街(2小时) ",
  },
  {
    "img": "images/wy.jpg",
    "title": "婺源之旅",
    "content": "Day 01: 文公山(2小时) → 鸳鸯湖(2小时) → 婺源博物馆(1小时)  \n Day 02: 晓起(3小时) → 江岭(2小时) → 庆源村(2小时)  \n Day 03: 思溪延村(2小时) → 彩虹桥(2小时) → 清华镇(1小时)  \n Day 04: 洪村(2小时) → 大鄣山(3小时) → 理坑(2小时)",
  },
  {
    "img": "images/xian.jpg",
    "title": "西安之旅",
    "content": "Day 01: 华清宫(2小时) → 秦始皇兵马俑博物馆(2小时)  \n Day 02: 华山(1天)  \n Day 03: 回民街(2小时) → 大慈恩寺(2小时) → 大雁塔北广场(2小时) → 永兴坊(2小时) ",
  },
  {
    "img": "images/xm.jpg",
    "title": "厦门之旅",
    "content": "Day 01: 南普陀寺(2小时) → 厦门大学(3小时) → 中山路步行街(2小时)   \n Day 02: 集美学村(3小时) → 厦大白城沙滩(1小时) → 胡里山炮台(1小时) → 环岛路木栈道(1小时)   \n Day 03: 日光岩(鼓浪屿)(1小时) → 菽庄花园(1小时) → 皓月园(1小时) → 厦门海底世界(2小时) → 鼓浪屿风琴博物馆(1小时) → 厦门市鼓浪屿风景名胜区-三一堂(0.5小时)   \n Day 04: 赵小姐的店（鼓浪屿店）(0.5小时) → 陈罐西式茶货铺(街心店)(0.5小时) → 曾厝垵(4小时)",
  },
  {
    "img": "images/zjj.jpg",
    "title": "张家界之旅",
    "content": "Day 01: 张家界国家森林公园(1天)  \n Day 02: 袁家界(2小时) → 杨家界(2小时) → 天子山(2小时)  \n Day 03: 张家界十里画廊(2小时) → 金鞭溪(2小时) → 张家界大峡谷玻璃桥(2小时)  \n Day 04: 天门山索道(1小时) → 天门山国家森林公园鬼谷栈道(2小时) → 天门山玻璃栈道(2小时) → 天门洞(2小时)",
  },
];